import streamlit as st
import pandas as pd
import plotly.express as px

st.title("Рейтинг спортсменів стрільців з практичної стрільби з карабіну")

file_path = "https://storage.googleapis.com/alphastats_ratings/rating_carabin_1_20240707.csv"
df = pd.read_csv(file_path,
                 sep=",")

df_sorted = df.sort_values(by=['rank_num']).round(2).set_index(df.columns[0])

df_formated = df_sorted.rename(columns={'rank_num': 'Номер у рейтингу', 'shooters_name': 'Ім\'я спортсмена', 'rating': 'Рейтинг', 'class': 'Клас спортсмена','class_avg':'Середній результат','matches':'Кількість матчів'})

st.write("Останне оновлення рейтингу 2024.07.07")

st.write("Таблиця рейтингів* та классів**")
st.write(df_formated)

fig = px.histogram(df_formated, x="Рейтинг")
st.write(fig)

fig2 = px.histogram(df_formated, x="Клас спортсмена")
st.write(fig2)

st.write("* для розрахунку рейтингу використовуються данні з останніх 6 матчів національного рівня (Чемпіонат України, Кубок України). Якщо спортсмен пропустив матч, то за такий матч спортсмен отримує свій найгірший результат помножений на 0.75. Далі результати за останні 6 матчів перемножуються на наступні коєфіцієнти: 1.0, 0.9, 0.8, 0.7, 0.6, 0.5, тачим чином, що б матчі, які видбулись останніми, мали вищу вагу. Сума результатів і є рейтингом спортсмена. Максимальний теоретично можливий тейтинг складає 450 балів (потрібно виграти 6 останніх матчів).")
st.write("** для розрахунку класса використовуються відсотки набрані спортсменом у останніх 6 матчах. З них беруться два найкращіх результата і обраховуєтся цередне значення цих двох найкращіх. Далі, відповідно до результатів вихначаються відповідні класи: Grand Master - 95-100%, Master - 85-94.9%, A - 75-84.9%, B - 60-74.9%, C - 40-59.9%, D - 2-39.9%")
